[
    "Adding audio to the step-by-step visuals in Professional Learning modules would benefit audio learners.",
    "Teachers want a shortcut to access the messaging feature in CTLS, allowing them to send messages directly to parents without having to navigate through multiple menus.",
    "Teachers want a \"trash can\" feature under Resources in the Digital Classroom where they can delete accidentally added files, preventing confusion for students.",
    "The user is requesting the addition of a CTLS Parent feature that would allow them, as an attendance clerk, to receive student absence notes submitted by parents through the system.",
    "The school nurse wants the ability to send emails to parents of students who have visited the clinic, as this method has been shown to be more effective than phone calls. This feature would also be helpful for non-English speaking parents who may not understand voice messages.",
    "Teachers want the idle timeout feature in CTLS to be adjusted to keep them logged in for a longer period before logging out automatically.",
    "Users want an easier way to share photos with parents, specifically a feature that allows uploading and sending pictures directly from a student's page in 1-2 clicks.",
    "Kindergarten teachers need a simpler way to share photos with parents, ideally a feature similar to Seesaw that allows them to easily take and send photos in less than 12 clicks, currently it takes 15.",
    "Parents want the system to display each child's name only once when sending messages, rather than multiple duplicate entries, making it easier and less time-consuming for them to communicate with parents.",
    "A filter is requested in the gradebook to categorize students by their assignment status: missing, submitted (awaiting grading), and already graded, to simplify navigation and group students into actionable groups.",
    "Request to align CTLS performance bands with Georgia Milestones performance bands, using the following scale: L1 (0-67), L2 (68-79), L3 (80-91), and L4 (92-100).",
    "Linking PowerPoint presentations directly into Enhanced Phonics lessons in CTLS would make it easier for teachers to access and use them while teaching, creating a more cohesive resource within lesson plans.",
    "Teachers should be able to edit student coursework even after it has been \"pushed\" from a common CTLS classroom, allowing for individual adjustments.",
    "When creating a teacher-paced item, a rubric must be attached before saving and closing.",
    "The user experiences a delay logging into CTLS after initially attempting to log in. They must close the browser tab and reopen CTLS for login to be successful.",
    "When creating a video recording within the text editor, CTLS should allow users to automatically start recording their screen instead of defaulting to the integrated webcam.",
    "Parents want to be able to access and print past year's report cards from ParentVue without needing to contact the school.",
    "Add AI detection software to identify potentially copied or plagiarized content in assignments, using tools like Turnitin.com or Grammarly.",
    "The calendar feature in CTLS does not allow deleting individual dates within a recurring event without deleting the entire event. A desired feature is to have the ability to delete specific dates (e.g., Fall break or Winter break) while keeping the overall recurring event intact, similar to Google Calendar functionality.",
    "Teachers need the ability to quickly return all students to the waiting room with one click in case of a classroom disruption, allowing for easier management during online classes.",
    "Students want to view incorrect answers after taking an assessment, similar to how Microsoft Forms displays them.",
    "Teachers would like to have easy access to the Clever icon directly on the teacher dashboard in CTLS, likely on the home page under District Links, to simplify navigation and reduce frustration with accessing it through the Company Portal or bookmarking the URL.",
    "Request: Add a direct link to Clever on the district sign-in page in CTLS, allowing users to access it more easily and potentially bypassing the need to navigate through CTLS first.",
    "The parent would like the ability to schedule automatic messages in CTLS, allowing them to send notifications or reminders at a specified date and time.",
    "Users want to be able to directly assign and access District Math Course work assessments within CTLS Assess, rather than just linking them.",
    "Add a \"Send Later\" button in the CTLS Parent messenger, allowing users to schedule messages to be sent at a later time, enabling better work-life balance and setting boundaries with parents.",
    "When printing assessments with fill-in-the-blank questions, CTLS does not include the answer choices for the blank or the correct answer on the printed copy, resulting in formatting issues.",
    "Default scoring levels in Assess should align with Cobb's grading scale: 0-69, 70-73, 74-79, 80-89, and 90-100.",
    "The user suggests changing the name of the \"Home\" dropdown menu in the parent view to something else, and moving the messages function to its own top-level or dropdown menu for easier access. The current menu is confusing due to its similarity with the \"Home\" icon in the sidebar.",
    "Provide a review of student answers on incorrectly answered assessment questions, showing chosen answer and correct answer.",
    "Enhance the CTLS-Teach homescreen announcement widget to display which community/class an announcement is from, make it clickable to take users directly to that community/class, and provide an option to view announcements as a condensed list/feed or an expanded preview tile.",
    "The Studio editor for CTLS parent posts should be made more user-friendly.",
    "A teacher requests to restore the Parent Communication link at the bottom of their CTLS homepage, making it easily accessible for sending messages to parents. The current process requires signing in with teaching credentials and navigating through additional screens.",
    "Teachers should be able to share CTLS parent post templates with each other, allowing for consistency in messaging across grade levels.",
    "Add an upload feature to allow users to import or draw on images within CTLS.",
    "The user finds it difficult to switch between multiple CTLS Learn accounts on the app, with issues including logging out of one account and having to re-enter credentials to access another account, which defaults back to the previous one logged in as.",
    "The Enhancement Request is for a periodic table to be made available to students during Physical Science tests, similar to the Milestones tool, with an optional color-specific feature.",
    "Students suggest adding a \"My Classes\" widget to their dashboard for easier navigation to specific digital classrooms, particularly beneficial for young or disabled students."
]